Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་མཛད་པ་མཐོང་ཞིང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོ་རབ་ཏུ་ཐོབ་བོ། །
en: Seeing that, in each instant I experience an ocean of the power of great joy.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་དབུ་དང་། སྐུ་ཕྲག་པ་གཉིས་ཀྱི་ལྷུན་ལས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་འོད་འཕྲོ་བའི་རིའི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་འབྱུང་ཞིང་། ཆོས་ཀྱི་དབྱིངས་རྒྱ་མཚོ་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་མཐོང་ནས།
en: “Moreover, noble one, I see that in each instant of mind, from the head and shoulders of the Bhagavat Vairocana there come clouds, as numerous as the atoms in all buddha realms, of mountains of light rays from all jewels, and they fill the entire realm of phenomena.

source: དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོ་ཤིན་ཏུ་ཡངས་པ་རབ་ཏུ་ཐོབ་བོ། །
en: Seeing that, in each instant I attain an ocean of the power of great joy.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུའི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཁ་དོག་དྲི་ཞིམ་པོ་དང་། འོད་གཟེར་སྣ་ཚོགས་ཅན་གྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་འབྱུང་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་མཐོང་ནས།
en: “Moreover, noble one, I see that from each pore on the body of the Bhagavat Vairocana, in each instant of mind, come clouds, as numerous as the atoms in all buddha realms, of various colors, scents, and light rays, and they fill all the buddha realms.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ལ་རྣམ་པར་བལྟས་ན། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་མཚན་རེ་རེ་ནས། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་མཚན་གྱིས་རབ་ཏུ་བརྒྱན་པའི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་མཐོང་ནས་དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོ་ཤིན་ཏུ་ཡངས་པ་རབ་ཏུ་ཐོབ་བོ། །
en: “Moreover, noble one, when I gaze upon the body of the Bhagavat Vairocana, in each instant of mind, from each of his physical signs of a great being come clouds, as numerous as the atoms in all buddha realms, of the form bodies of tathāgatas adorned by the signs, and they fill the entire ocean of world realms.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུའི་དཔེ་བྱད་བཟང་པོ་རེ་རེ་ལས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པའི་སྐུ་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་ཤིན་ཏུ་འབར་བའི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་འབྱུང་སྟེ།
en: Seeing that, in each instant I attain an ocean of the power of great joy. “Moreover, noble one, from the features of a great being on the body of the Bhagavat Vairocana, in each instant of mind, from each of his physical signs of a great being come clouds, as numerous as the atoms in all buddha realms, of the emanation bodies of tathāgatas brightly adorned by the eighty features, and they fill all the buddha realms and roar out the thunder of the sound of the wheel of the Dharma.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རྒྱས་པར་འགེངས་ཤིང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོའི་དབྱངས་སུ་སྒྲོག་པའི་འབྲུག་སྒྲ་འབྱིན་པ་མཐོང་ནས་དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོ་ཤིན་ཏུ་ཡངས་པ་རབ་ཏུ་ཐོབ་བོ། །
en: Seeing that, in each instant I attain an ocean of the power of great joy.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ལ་རྣམ་པར་བལྟས་ན། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་སངས་རྒྱས་རྣམ་པར་འཕྲུལ་པའི་སྐུ་དང་པོ་བྱང་ཆུབ་ཏུ་ཐུགས་བསྐྱེད་པ་དང་བཅས། ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་རྣམ་པར་དག་པའི་རྒྱན་དང་བཅས།
en: “Moreover, noble one, when I gaze upon the body of the Bhagavat Vairocana, in each instant of mind, from all the pores on his body come manifested bodies that make the first aspiration to enlightenment, that have the display of the pure path of the perfections and ascend the bodhisattva bhūmis, and that are as numerous as the atoms in countless buddha realms.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནོན་པའི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་འབྱུང་བ་མཐོང་ནས་དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོ་ཤིན་ཏུ་ཡངས་པ་རབ་ཏུ་ཐོབ་བོ། །
en: Seeing that, in each instant I attain an ocean of the power of great joy.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ལས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ལྷའི་དབང་པོའི་ལུས་ཀྱི་སྤྲིན་ལྷའི་དབང་པོའི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་པ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཕྲ་བ་སྙེད་བྱུང་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། ལྷའི་དབང་པོའི་ལུས་ཡོངས་སུ་བསྟན་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་མངོན་དུ་གནས་ཤིང་ཆོས་སྟོན་པ་མཐོང་ནས།
en: “Moreover, noble one, from the body of the Bhagavat Vairocana, in each instant of mind, come clouds of bodies of a lord of the devas, together with the miraculous manifestations of a lord of the devas, and they are as numerous as the atoms in countless buddha realms, fill all world realms, manifest the body of a lord of the devas in front of beings, and teach them the Dharma.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ལས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཀླུའི་དབང་པོའི་ལུས་ཀྱི་སྤྲིན་ཀླུའི་དབང་པོའི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་པ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ།
en: “Moreover, noble one, from the body of the Bhagavat Vairocana, in each instant of mind, come clouds of bodies of a lord of the nāgas, together with the miraculous manifestations of a lord of the nāgas, and they are as numerous as the atoms in countless buddha realms, fill all world realms, manifest the body of a lord of the nāgas in front of beings, and teach them the Dharma.

source: ཀླུའི་དབང་པོའི་ལུས་ཡོངས་སུ་བསྟན་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་མངོན་དུ་གནས་ཤིང་ཆོས་སྟོན་པ་མཐོང་ནས་དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོ་ཤིན་ཏུ་ཡངས་པ་རབ་ཏུ་ཐོབ་བོ། །
en: Seeing that, in each instant I attain an ocean of the power of great joy.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ལ་རྣམ་པར་བལྟས་ན། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་གནོད་སྦྱིན་གྱི་དབང་པོའི་ལུས་ཀྱི་སྤྲིན་གྱི་གནོད་སྦྱིན་གྱི་དབང་པོའི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་པ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ཞིང་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། གནོད་སྦྱིན་གྱི་དབང་པོའི་ལུས་ཡོངས་སུ་བསྟན་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་མངོན་དུ་གནས་ཤིང་ཆོས་སྟོན་པ་མཐོང་ནས།
en: “Moreover, noble one, from the body of the Bhagavat Vairocana, in each instant of mind, come clouds of bodies of a lord of the yakṣas, together with the miraculous manifestations of a lord of the yakṣas, and they are as numerous as the atoms in countless buddha realms, fill all world realms, manifest the body of a lord of the yakṣas in front of beings, and teach them the Dharma.

source: དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོ་ཤིན་ཏུ་ཡངས་པ་རབ་ཏུ་ཐོབ་བོ། །རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ལ་རྣམ་པར་བལྟས་ན་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས།
en: Seeing that, in each instant I attain an ocean of the power of great joy.

source: དྲི་ཟའི་དབང་པོའི་ལུས་ཀྱི་སྤྲིན་དྲི་ཟའི་དབང་པོའི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་པ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ཞིང་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ།
en: “Moreover, noble one, from the body of the Bhagavat Vairocana, in each instant of mind, come clouds of bodies of a lord of the gandharvas, together with the miraculous manifestations of a lord of the gandharvas, and they are as numerous as the atoms in countless buddha realms, fill all world realms, manifest the body of a lord of the gandharvas in front of beings, and teach them the Dharma.

source: དྲི་ཟའི་དབང་པོའི་ལུས་ཡོངས་སུ་བསྟན་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་མངོན་དུ་གནས་ཤིང་ཆོས་སྟོན་པ་མཐོང་ནས་དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོ་ཤིན་ཏུ་ཡངས་པ་རབ་ཏུ་ཐོབ་བོ། །
en: Seeing that, in each instant I attain an ocean of the power of great joy.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ལ་རྣམ་པར་བལྟས་ན་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ལྷ་མ་ཡིན་གྱི་དབང་པོའི་ལུས་ཀྱི་སྤྲིན་ལྷ་མ་ཡིན་གྱི་དབང་པོའི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་པ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། ལྷ་མ་ཡིན་གྱི་དབང་པོའི་ལུས་ཡོངས་སུ་བསྟན་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་མངོན་པར་གནས་ཤིང་།
en: “Moreover, noble one, from the body of the Bhagavat Vairocana, in each instant of mind, come clouds of bodies of a lord of the asuras, together with the miraculous manifestations of a lord of the asuras, and they are as numerous as the atoms in countless buddha realms, fill all world realms, manifest the body of a lord of the asuras in front of beings, and teach them the Dharma.

source: ཆོས་སྟོན་པ་མཐོང་ནས་དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོ་ཤིན་ཏུ་ཡངས་པ་རབ་ཏུ་ཐོབ་བོ། །
en: Seeing that, in each instant I attain an ocean of the power of great joy.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ལ་རྣམ་པར་བལྟས་ན། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ནམ་མཁའི་ལྡིང་གི་དབང་པོའི་ལུས་ཀྱི་སྤྲིན་ནམ་མཁའ་ལྡིང་གི་དབང་པོའི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་པ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། ནམ་མཁའ་ལྡིང་གི་དབང་པོའི་ལུས་ཡོངས་སུ་བསྟན་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་མངོན་དུ་གནས་ཤིང་ཆོས་སྟོན་པ་མཐོང་ནས།
en: “Moreover, noble one, from the body of the Bhagavat Vairocana, in each instant of mind, come clouds of bodies of a lord of the garuḍas, together with the miraculous manifestations of a lord of the garuḍas, and they are as numerous as the atoms in countless buddha realms, fill all world realms, manifest the body of a lord of the garuḍas in front of beings, and teach them the Dharma.

source: དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོ་ཤིན་ཏུ་ཡངས་པར་རབ་ཏུ་ཐོབ་བོ། །
en: Seeing that, in each instant I attain an ocean of the power of great joy.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ལ་རྣམ་པར་བལྟས་ན་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བ་སྤུའི་སྒོ་རེ་རེ་ནས་མིའམ་ཅིའི་དབང་པོའི་ལུས་ཀྱི་སྤྲིན་མིའམ་ཅིའི་དབང་པོའི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་པ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ཞིང་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། མིའམ་ཅིའི་དབང་པོའི་ལུས་ཡོངས་སུ་བསྟན་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་མངོན་དུ་གནས་ཤིང་ཆོས་སྟོན་པ་མཐོང་ནས།
en: “Moreover, noble one, from the body of the Bhagavat Vairocana, in each instant of mind, come clouds of bodies of a lord of the kinnaras, together with the miraculous manifestations of a lord of the kinnaras, and they are as numerous as the atoms in countless buddha realms, fill all world realms, manifest the body of a lord of the kinnaras in front of beings, and teach them the Dharma.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ལ་རྣམ་པར་བལྟས་ན་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ལྟོ་འཕྱེ་ཆེན་པོའི་ལུས་ཀྱི་སྤྲིན་ལྟོ་འཕྱེ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་པ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ཞིང་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་བཀང་སྟེ།
en: “Moreover, noble one, from the body of the Bhagavat Vairocana, in each instant of mind, come clouds of bodies of a lord of the mahoragas, together with the miraculous manifestations of a lord of the mahoragas, and they are as numerous as the atoms in countless buddha realms, fill all world realms, manifest the body of a lord of the mahoragas in front of beings, and teach them the Dharma.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའི་ལུས་ཡོངས་ས་བསྟན་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་མངོན་དུ་གནས་ཤིང་ཆོས་སྟོན་པ་མཐོང་ནས་དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོ་ཤིན་ཏུ་ཡངས་པ་རབ་ཏུ་ཐོབ་བོ། །
en: Seeing that, in each instant I experience an ocean of the power of great joy.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ལ་རྣམ་པར་བལྟས་ན། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བ་སྤུའི་སྒོ་རེ་རེ་ནས་མིའི་དབང་པོའི་ལུས་ཀྱི་སྤྲིན་མིའི་དབང་པོའི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་པ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ཞིང་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། མིའི་དབང་པོའི་ལུས་ཡོངས་སུ་བསྟན་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་མངོན་དུ་གནས་ཤིང་ཆོས་སྟོན་པ་མཐོང་ནས།
en: “Moreover, noble one, from the body of the Bhagavat Vairocana, in each instant of mind, come clouds of bodies of a lord of humans, together with the miraculous manifestations of a lord of humans, and they are as numerous as the atoms in countless buddha realms, fill all world realms, manifest the body of a lord of humans in front of beings, and teach them the Dharma.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྐུ་ལ་རྣམ་པར་བལྟས་ན་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཚངས་པའི་དབང་པོའི་ལུས་ཀྱི་སྤྲིན་ཚངས་པའི་དབང་པོའི་རྣམ་པར་འཕྲུལ་པའི་ཡུལ་དང་བཅས་པ། སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ཞིང་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ།
en: “Moreover, noble one, from the body of the Bhagavat Vairocana, in each instant of mind, come clouds of bodies of a lord of the Brahmās, together with the miraculous manifestations of a lord of the Brahmās, and they are as numerous as the atoms in countless buddha realms, fill all world realms, manifest the body of a lord of the Brahmās in front of beings, and with the voice of a Brahmā teach them the Dharma.

source: ཚངས་པའི་དབང་པོའི་ལུས་ཡོངས་སུ་བསྟན་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་མངོན་དུ་གནས་ཤིང་ཚངས་པའི་སྒྲ་སྐད་དང་དབྱངས་ཀྱིས་ཆོས་སྟོན་པ་མཐོང་ནས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་དགའ་བ་ཆེན་པོའི་ཤུགས་རྒྱ་མཚོ་ཆོས་ཀྱི་དབྱིངས་ལྟར་རྒྱ་ཆེ་ཞིང་ཤིན་ཏུ་ཡངས་པ་རབ་ཏུ་འཐོབ་སྟེ།
en: Seeing that, in each instant I attain an ocean of the power of the great joy of omniscience that is as extremely vast and extensive as the realm of phenomena.

source: སྔོན་ཐོབ་པར་གྱུར་པ་འཐོབ་པར་འགྱུར་བ་མ་ཡིན་ནོ། །
en: “I attain what I have not previously attained.

source: སྔོན་ཁོང་དུ་ཆུད་པཁོང་དུ་ཆུད་པར་འགྱུར་བ་མ་ཡིན་ནོ། །
en: I realize what I have not previously realized.

source: སྔོན་ཞུགས་པ་ལ་འཇུག་པར་འགྱུར་བ་མ་ཡིན་ནོ། །
en: I comprehend what I have not previously comprehended.

source: སྔོན་ཁྱབ་པར་གྱུར་པ་ཁྱབ་པར་འགྱུར་བ་མ་ཡིན་ནོ། །
en: I permeate what I have not previously permeated.

source: སྔོན་མཐོང་བ་མཐོང་བར་འགྱུར་བ་མ་ཡིན་ནོ། །
en: I see what I have not previously seen.

source: སྔོན་ཐོས་པ་ཐོས་པར་འགྱུར་བ་མ་ཡིན་ནོ། །
en: I hear what I have not previously heard.

source: ཆོས་ཀྱི་རང་བཞིན་གྱི་མཚན་ཉིད་ཡོངས་སུ་ཤེས་པ་ལྟར་ན་ཆོས་ཐམས་ཅད་མཚན་ཉིད་གཅིག་པའང་ཅི་རོབ་མ་ཡིན་ཏེ། དུས་གསུམ་གྱི་ཚུལ་ལ་འཇུག་པའི་སྒོ་ནས་ཆོས་ཐམས་ཅད་ཀྱང་མཐའ་དང་དབུས་མེད་པར་བསྟན་དུ་ཡོད་པ་སྟེ།
en: The characteristic of the nature of phenomena being known, all phenomena have a single characteristic, and, also, as all phenomena appear in the three times, they are taught to be without limit or center.

source: འདི་ནི་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཚུལ་དགའ་བ་ཡངས་པའི་ཤུགས་འབྱུང་བས་སེམས་ཀྱི་སྐད་ཅིག་རྣམ་པར་ཐར་པའི་ཚུལ་རྒྱ་མཚོའི་སྣང་བ་སྟེ། རིགས་ཀྱི་བུ་རྣམ་པར་ཐར་པ་འདི་ནི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པའི་ཕྱིར་མཐའ་དང་དབུས་མེད་པའོ། །
en: “Noble one, this bodhisattva liberation has no limit or center because it comprehends the ocean of the ways of the realm of the Dharma.

source: རྣམ་པར་ཐར་པ་འདི་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་བསྐྱེད་པ་དང་། ཐ་མི་དད་པས་ཟད་མི་ཤེས་པའོ། །
en: “This liberation is imperishable because it is no different from the aspiration to omniscience.

source: རྣམ་པར་ཐར་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་མིག་གིས་རྣམ་པར་ཤེས་པར་བྱ་བ་ཡིན་པས་མུ་མེད་པའོ། །
en: “This liberation is unlimited because it is known by the wisdom eyes of the bodhisattvas.

source: རྣམ་པར་ཐར་པ་འདི་ནི་ཆོས་ཀྱི་དབྱིངས་ཐ་མི་དད་པའི་ཚུལ་གྱི་གཏན་དུ་རྒྱས་པར་འགེངས་པས་གཏིང་མེད་པའོ། །
en: “This liberation is unfathomable because it completely and fully pervades the undifferentiated way of the realm of Dharma.

source: རྣམ་པར་ཐར་པ་འདི་ནི་དམིགས་པ་གཅིག་ཏུ་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ཡོངས་སུ་འདུ་བར་བྱེད་པས་སྒོ་ཐམས་ཅད་དང་ལྡན་པའོ། །
en: “This liberation has all Dharma gateways because it includes all miraculous manifestations within a single object.

source: རྣམ་པར་ཐར་པ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ལུས་དང་མི་གཉིས་པར་སྤྱོད་པས་དོན་ཡོད་པའོ། །
en: “This liberation is beneficial because it is united with the body of the entire Dharma.

source: རྣམ་པར་ཐར་པ་འདི་ནི་སྒྱུ་མ་ལྟ་བུར་ཡོངས་སུ་སྤྱོད་པས་མ་སྐྱེས་པའོ། །
en: “This liberation is unborn because its practice is like an illusion.

source: རྣམ་པར་ཐར་པ་འདི་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྨོན་ལམ་གྱི་གཟུགས་བརྙན་དུ་བྱུང་བས་གཟུགས་བརྙན་ལྟ་བུའོ། །
en: “This liberation is like a reflection because it arises as a reflection of the prayer for omniscience.

source: རྣམ་པར་ཐར་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་ཤིན་ཏུ་སྤྲུལ་པའི་ཕྱིར་སྤྲུལ་པ་ལྟ་བུའོ། །
en: “This liberation is like an emanation because it is an emanation of bodhisattva conduct.

source: རྣམ་པར་ཐར་པ་འདི་ནི་འགྲོ་བ་ཐམས་ཅད་ཀྱི་རྟེན་དུ་གྱུར་པས་ས་ཆེན་པོ་ལྟ་བུའོ། །
en: “This liberation is like the great earth because it is a support for all beings.

source: རྣམ་པར་ཐར་པ་འདི་ནི་འགྲོ་བ་ཐམས་ཅད་སྙིང་རྗེ་ཆེན་པོས་མངོན་པར་རླན་པར་བྱེད་པས་ཆུའི་ཕུང་པོ་ལྟ་བུའོ། །
en: “This liberation is like a mass of water because it saturates all beings with compassion.

source: རྣམ་པར་ཐར་པ་འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྲེད་པའི་རླན་ཡོངས་སུ་སྐེམས་པས་མྱེའི་ཕུང་པོ་ལྟ་བུའོ། །
en: “This liberation is like a mass of fire because it dries up the liquid of craving in all beings.

source: རྣམ་པར་ཐར་པ་འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པོ་ཉིད་དུ་རབ་ཏུ་སྟོན་པའི་ཕྱིར་རླུང་གི་ཕུང་པོ་ལྟ་བུའོ། །
en: “This liberation is like a mass of air because it reveals omniscience to all beings.

source: རྣམ་པར་ཐར་པ་འདི་ནི་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་གྱི་རྒྱན་གྱི་གཞི་ཡིན་པས་རྒྱ་མཚོ་ལྟ་བུའོ། །
en: “This liberation is like an ocean because it is the basis for the adornment of good qualities for all beings.

source: རྣམ་པར་ཐར་པ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་རིན་པོ་ཆེ་རྒྱ་མཚོ་ལས་མངོན་པར་འཕགས་པས་རི་རབ་རིའི་རྒྱལ་པོ་ལྟ་བུའོ། །
en: “This liberation is like Meru, the king of mountains, because it rises up from the ocean of the precious knowledge of the entire Dharma.

source: རྣམ་པར་ཐར་པ་འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པར་ཐར་པའི་གཞལ་མེད་ཁང་རྣམ་པར་སྤྱོད་པའི་ཕྱིར་རྣམ་པར་སྤྱོད་པའི་རླུང་གི་དཀྱིལ་འཁོར་ལྟ་བུའོ། །
en: “This liberation is like the circle of the wind because it is the practice of the aerial palace of liberation of all the Dharma.

source: རྣམ་པར་ཐར་པ་འདི་ནི་དུས་གསུམ་དུ་འབྱུང་བའི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ཀྱི་གོ་འབྱེད་པས་ནམ་མཁའ་ལྟ་བུའོ། །
en: “This liberation is like space because it provides room for all the miraculous manifestations of the tathāgatas who appear in the three times.

source: རྣམ་པར་ཐར་པ་འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་དུ་འབེབས་པས་སྤྲིན་ཆེན་པོ་ལྟ་བུའོ། །
en: “This liberation is like a great cloud because it sends down a rain of Dharma on all beings.

source: རྣམ་པར་ཐར་པ་འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མི་ཤེས་པའི་མུན་ནག་རྣམ་པར་སེལ་བས་ཉི་མ་ལྟ་བུའོ། །
en: “This liberation is like the sun because it dispels the darkness of ignorance in all beings.

source: རྣམ་པར་ཐར་པ་འདི་ནི་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོས་ཤིན་ཏུ་བསྒྲུབ་པའི་ཕྱིར་ཟླ་བ་ལྟ་བུའོ། །
en: “This liberation is like the moon because it is produced by a great ocean of merit and wisdom.

source: རྣམ་པར་ཐར་པ་འདི་ནི་ཐམས་ཅད་དུ་སོང་བའི་ཕྱིར་དེ་བཞིན་ཉིད་ལྟ་བུའོ། །
en: “This liberation is like the true nature because it is omnipresent.

source: རྣམ་པར་ཐར་པ་འདི་ནི་ལས་ཀྱི་ཆོས་ཀྱིས་ཤིན་ཏུ་སྤྲུལ་པའི་ཕྱིར་རང་གི་གྲིབ་མ་ལྟ་བུའོ། །
en: “This liberation is like one’s shadow because it is emanated through the Dharma of karma.

source: རྣམ་པར་ཐར་པ་འདི་ནི་སེམས་ཅན་གྱི་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ཀྱི་སྒྲ་རབ་ཏུ་སྒྲོགས་པས་བྲག་ཆ་ལྟ་བུའོ། །
en: “This liberation is like an echo because it resounds the words of the Dharma in accordance with the dispositions of beings.

source: རྣམ་པར་ཐར་པ་འདི་ནི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་དམིགས་པར་བྱེད་པའི་ཕྱིར་གཟུགས་བརྙན་ལྟ་བུའོ། །
en: “This liberation is like a reflection because it is perceived by all beings in accordance with their dispositions.

source: རྣམ་པར་ཐར་པ་འདི་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པའི་མེ་ཏོག་ཤིན་ཏུ་རྒྱས་པའི་ཕྱིར་ཤིང་གི་རྒྱལ་པོ་ལྟ་བུའོ། །
en: “This liberation is like the king of trees because it blossoms with the miraculous manifestations of all the buddhas.

source: རྣམ་པར་ཐར་པ་འདི་ནི་མི་ཤིག་པའི་ཆོས་ཅན་ཡིན་པས་རྡོ་རྗེ་ལྟ་བུའོ། །
en: “This liberation is like a vajra because it has the quality of indestructibility.

source: རྣམ་པར་ཐར་པ་འདི་ནི་རྣམ་པར་འཕྲུལ་པ་མཐའ་དང་དབུས་མེད་པ་རྒྱ་མཚོ་མངོན་པར་བསྒྲུབ་པས། ནོར་བུ་ཡིད་བཞིན་རིན་པོ་ཆེའི་རྒྱལ་པོ་ལྟ་བུའོ། །
en: “This liberation is like the king of wish-fulfilling jewels because it creates a limitless, centerless ocean of miraculous manifestations.

source: རྣམ་པར་ཐར་པ་འདི་ནི་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་རྣམ་པར་དམིགས་པར་བྱ་བ་ལ་སྒྲིབ་པ་མེད་པས་རིན་པོ་ཆེའི་རྒྱལ་པོ་དྲི་མ་མེད་པའི་སྙིང་པོ་ལྟ་བུའོ། །
en: “This liberation is like the essence of a stainless king of jewels because of its unobscured perception of the miraculous manifestations of the tathāgatas in the three times.

source: རྣམ་པར་ཐར་པ་འདི་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་མཉམ་པོ་ཉིད་དུ་སྒྲོག་པས་ནོར་བུ་རིན་པོ་ཆེ་དགའ་བའི་རྒྱལ་མཚན་ལྟ་བུ་སྟེ།
en: “This liberation is like the precious jewel of a banner of happiness because it emits the sound of the Dharma wheels of all buddhas equally.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དགའ་བ་ཡངས་པའི་ཤུགས་ཤིན་ཏུ་ཡངས་པ་འབྱུང་བས་སེམས་ཀྱི་སྐད་ཅིག་རྣམ་པར་བརྒྱན་པ་འདི་ནི་དཔེ་ཚད་མེད་པ་རྣམ་པར་འགོད་པའི་རྗེས་སུ་འབྲང་བས་བསྟན་པར་བྱའོ། །
en: “Thus, noble one, the bodhisattva liberation the display in each instant of mind of the arising of the power of vast delight is taught by following an array of limitless examples.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་ལྷ་མོ་ཇི་ལྟར་ནན་ཏན་དུ་བགྱིས་ན། བྱང་ཆུབ་སེམས་དཔས་དེ་ལྟ་བུའི་རྣམ་པར་ཐར་པ་དེ་ཡོངས་སུ་འགྲུབ་པར་འགྱུར།
en: Then Sudhana, the head merchant’s son, said to the night goddess Praśanta­ruta­sāgara­vatī, “Āryā, goddess, how does a bodhisattva practice in order to accomplish such a liberation?”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚོགས་ཆེན་པོ་ཆོས་ཡངས་པ་དང་ལྡན་པ། རྣམ་པར་རྒྱ་ཆེན་པོ་གསལ་བ་ཆེན་པོ་སྣང་བ་ཆེན་པོ། འོད་ཆེན་པོ་བྱིན་ཆེན་པོ་རྣམ་པར་དབྱེ་བ་ཆེན་པོ་འབྱུང་བ་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པ་ཆེན་པོ་སྟེ།
en: She answered, “Noble one, there are these ten: a great accumulation, a great abundance of qualities, a great vastness, a great brightness, a great illumination, a great brilliance, a great portion, a great share, a great becoming, and the great fortune of the bodhisattvas.

source: དེ་དག་ལ་ནན་ཏན་དུ་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྣམ་པར་ཐར་པ་འདི་ལྟ་བུ་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་དག་གོ །
en: “If bodhisattvas practice them, they will attain a perfect result such as this liberation.

source: བཅུ་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: “What are these ten?

source: བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པ་སེམས་ཅན་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་ལ་ཞུགས་པ་ནི་རྒྱ་ཆེན་པོའི་ཆོས་སོ། །
en: (1) Engaging in the generosity of a bodhisattva, which satisfies all beings in accordance with their aspirations, is a vast quality.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་རྒྱ་མཚོ་ལ་འཇུག་པའི་ནན་ཏན་ལ་ཞུགས་པ་ནི་རྒྱ་ཆེན་པོའི་ཆོས་སོ། །
en: (2) Engaging in the practice of the correct conduct of a bodhisattva, which enters an ocean of the qualities of the tathāgatas, is a vast quality.

source: བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པར་བྱ་བ་ལ་ཞུགས་པ་ནི་རྒྱ་ཆེན་པོའི་ཆོས་སོ། །
en: (3) Engaging in the patience of a bodhisattva, which realizes the nature of all phenomena, is a vast quality.

source: བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡང་དག་པར་བརྩམས་པ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་ཞུགས་པ་ནི་རྒྱ་ཆེན་པོའི་ཆོས་སོ། །
en: (4) Engaging in the diligence of a bodhisattva, which undertakes attaining omniscience, is an extensive quality.

source: བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་ཞུགས་པ་ནི་རྒྱ་ཆེན་པོའི་ཆོས་སོ། །
en: (5) Engaging in the meditation of a bodhisattva, which pacifies the torment of the kleśas in all beings, is an extensive quality.

source: བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པར་བྱ་བ་ལ་ཞུགས་པ་ནི་རྒྱ་ཆེན་པོའི་ཆོས་སོ། །
en: (6) Engaging in the wisdom of a bodhisattva, which is knowing the entire ocean of the Dharma, is an extensive quality.
